Checking the problems before solution

In [2]:
import pandas as pd
import numpy as np

In [3]:
students = {
    "student_id" : [1,2,3,4,5,6,7,8],
    "first" : ["Anish", "Ramish",None, "Samish", np.nan,"Bamish", np.nan, 'NA'],
    "last" : ["Khadka", "Mainali", "Shrestha", "Karki", "Mainali", np.nan, np.nan, 'Missing'],
    "email" : [None, "mainaliramish89@gmail.com", 
               "shresthasamish28@gmail.com", None,"bamishkarki819@gmail.com",
               "mainaliramish89@gmail.com", np.nan, 'Missing'],
    "age": ['23', '24', '22', '26', '27', None, None, 'Missing']

}
mydf = pd.DataFrame(students)
mydf.set_index('student_id', inplace=True)
mydf

             first      last                       email      age
student_id
1            Anish    Khadka                        None       23
2           Ramish   Mainali   mainaliramish89@gmail.com       24
3             None  Shrestha  shresthasamish28@gmail.com       22
4           Samish     Karki                        None       26
5              NaN   Mainali    bamishkarki819@gmail.com       27
6           Bamish       NaN   mainaliramish89@gmail.com     None
7              NaN       NaN                         NaN     None
8               NA   Missing                     Missing  Missing

In [4]:
mydf.replace(['Missing', 'None', 'NA', None], np.nan, inplace=True)
mydf

             first      last                       email  age
student_id
1            Anish    Khadka                         NaN   23
2           Ramish   Mainali   mainaliramish89@gmail.com   24
3              NaN  Shrestha  shresthasamish28@gmail.com   22
4           Samish     Karki                         NaN   26
5              NaN   Mainali    bamishkarki819@gmail.com   27
6           Bamish       NaN   mainaliramish89@gmail.com  NaN
7              NaN       NaN                         NaN  NaN
8              NaN       NaN                         NaN  NaN

In [5]:
# mydf.loc[mydf['email'].duplicated(keep='first'), 'email'] = np.nan

In [6]:
mydf

             first      last                       email  age
student_id
1            Anish    Khadka                         NaN   23
2           Ramish   Mainali   mainaliramish89@gmail.com   24
3              NaN  Shrestha  shresthasamish28@gmail.com   22
4           Samish     Karki                         NaN   26
5              NaN   Mainali    bamishkarki819@gmail.com   27
6           Bamish       NaN   mainaliramish89@gmail.com  NaN
7              NaN       NaN                         NaN  NaN
8              NaN       NaN                         NaN  NaN

In [7]:
# Keeping only unique values
mydf.drop_duplicates(subset=['email'], keep='first', inplace=True)
mydf

             first      last                       email age
student_id
1            Anish    Khadka                         NaN  23
2           Ramish   Mainali   mainaliramish89@gmail.com  24
3              NaN  Shrestha  shresthasamish28@gmail.com  22
5              NaN   Mainali    bamishkarki819@gmail.com  27

Q. Keep only the unique values in email, keep the first occurence.

In [8]:
# mydf.drop_duplicates(subset=['email'], keep='first')

In [9]:
import pandas as pd

def createBonusColumn(employees: pd.DataFrame) -> pd.DataFrame:
    employees['bonus'] = 2 * employees['salary']
    return employees

In [10]:
import pandas as pd

def selectData(students: pd.DataFrame) -> pd.DataFrame:
    filt = (students['student_id'] == 101)
    return students.loc[filt][['name', 'age']]

In [12]:
import pandas as pd

def dropMissingData(students: pd.DataFrame) -> pd.DataFrame:
    students = students.dropna(subset=['name'])
    return students

In [13]:
import pandas as pd

def modifySalaryColumn(employees: pd.DataFrame) -> pd.DataFrame:
    employees['salary'] = 2 * employees['salary']
    return employees

In [ ]:
import pandas as pd

def renameColumns(students: pd.DataFrame) -> pd.DataFrame:
    students.rename(columns={'id':'student_id', 'first':'first_name', 'last':'last_name', 'age':'age_in_years'}, inplace=True)
    return students

In [ ]:
import pandas as pd

def changeDatatype(students: pd.DataFrame) -> pd.DataFrame:
    students['grade'] = students['grade'].astype(int)
    return students

In [1]:
import pandas as pd
import numpy as np

# Sample DataFrame with missing values (None, np.nan)
data = {
    'student_id': [1, 2, 3, 4],
    'name': ['Alice', None, 'Bob', 'Charlie'],
    'age': [20, np.nan, 22, None]
}
students = pd.DataFrame(data)

# Fill all missing values with 0
students = students.fillna(0)

# Display the result
print(students)

   student_id     name   age
0           1    Alice  20.0
1           2        0   0.0
2           3      Bob  22.0
3           4  Charlie   0.0

In [2]:
def fillMissingValues(products: pd.DataFrame) -> pd.DataFrame:
    products['quantity'] = products['quantity'].fillna(0)
    return products

In [3]:
def concatenateTables(df1: pd.DataFrame, df2: pd.DataFrame) -> pd.DataFrame:
    return pd.concat([df1, df2], ignore_index=True)

In [1]:
import pandas as pd

def pivotTable(weather: pd.DataFrame) -> pd.DataFrame:
    return weather.pivot(index='month', columns='city', values='temperature')

In [ ]:
# SELECT product_id
# FROM Products
# WHERE low_fats = 'Y' AND recyclable = 'Y';

import pandas as pd

def filterProducts(products: pd.DataFrame) -> pd.DataFrame:
    return products.loc[(products['low_fats'] == 'Y') & (products['recyclable'] == 'Y'), ['product_id']]

In [ ]:
# SELECT name, population, area FROM World
# WHERE area >= 3000000 OR population >= 25000000;
import pandas as pd

def filterWorld(world: pd.DataFrame) -> pd.DataFrame:
    return world.loc[(world['area'] >= 3000000) | (world['population'] >= 25000000), ['name', 'population', 'area']]

In [ ]:
# SELECT DISTINCT author_id id FROM Views
# WHERE author_id = viewer_id
# ORDER BY id ASC;
import pandas as pd

def filterViews(views: pd.DataFrame) -> pd.DataFrame:
    return views.loc[views['author_id'] == views['viewer_id'], ['author_id']].drop_duplicates().rename(columns={'author_id': 'id'}).sort_values(by='id')

In [ ]:
# I literally have nothing to show today. the day was really sad for me.
# let's get it going for me right now.